[
  {
    "id": 1974,
    "title": "Minimization of peak age of information  in LoRaWAN-based monitoring systems",
    "abstract": "We  study the communication network based on LoRaWAN technology. The communication network consists of N nodes and carries out one-way transmission of monitoring data to the base station (BS).  The messages from each node are sent to the BS at random time intervals and independently of each other. If they have the same spreading factor (SF) and airtimes of messages from two or more nodes overlap, a collision occurs and none of the messages reaches the operator. We assume that the importance of information from each node is different, and the peak  age of information (PAoI) is used \tto measure its freshness. We define the functional as the maximum PAoI among all nodes in the system, and our task is to find the parameters under which its minimization is achieved.\tWe choose various message intensities to account for different freshness of information from each node and formulate the problem of optimal SF allocation.",
    "authors": [
      "Dmitriy Kim"
    ]
  },
  {
    "id": 1926,
    "title": "Enhancing power efficiency through semi-markov modeling of Narrowband Internet of Things devices in 5G networks",
    "abstract": "Aiming to accommodate a large number of devices for low-bandwidth data\r\ntransmission, Narrowband Internet of Things (NB-IoT) encapsulates the concept\r\nof the Internet of Things [1]. However, an efficient power conservation paradigm\r\nfor battery-powered NB-IoT devices is crucial. In addition to the traditional\r\nDiscontinuous Reception (DRX) method, efficient beamforming helps to conserve\r\ndevice battery [2]. Further, the extended Discontinuous Reception (eDRX) mode\r\nand Power Saving Mode (PSM) in Radio Resource Control (RRC) inactive\r\nmode increase the effect of sleep when there is no data available for the device\r\nto serve [3, 4]. Using stochastic models, power-saving techniques for NB-IoT\r\ndevices are investigated in this paper. This paper proposes a semi-Markov model\r\n(SMM) for beam measurement and beamforming-based DRX in RRC modes. The\r\nSMM’s steady-state probabilities are calculated using a two-stage method [5]. The\r\nnumerical results demonstrate the contribution of efficient beamforming, eDRX\r\nstate, and PSM state to the enhancement of NB-IoT devices’ power efficiency.",
    "authors": [
      "Nikita Mittal"
    ]
  },
  {
    "id": 1973,
    "title": "Semi-orthogonal Precoder for Improving Throughput and Fairness in Downlink NOMA-MIMO Systems",
    "abstract": "In Non-Orthogonal Multiple Access (NOMA) systems, the base station can simultaneously transmit data from an antenna to a group of users. In this group, a user with higher channel gains performs  Successive Interference Cancellation (SIC) to mitigate interference from the signal destined for the user with a weak channel. Typically, downlink NOMA-MIMO (Multiple-Input Multiple-Output) systems use precoders that form beams focused on users with higher channel gains of each group. This approach induces interference on the users with low gain, degrading throughputs and fairness in the network. This paper proposes a novel semi-orthogonal precoder that forms non-orthogonal beams for users within each group, while maintaining orthogonality between the groups. Simulations show the efficiency of this approach in improving the geometric mean user throughput.",
    "authors": [
      "Ilya Levitsky",
      "Sergei Tutelian",
      "Aleksey Kureev",
      "Evgeny Khorov"
    ]
  },
  {
    "id": 1983,
    "title": "Numerical Evaluation of the Optimal Precoder Design for Mobile Users in MISO System",
    "abstract": "In paper the numerical  investigation of the impact of delayed channel state information (CSI) due to user movement and caused channel aging on the performance of multiuser precoder in downlink MISO system. The  time variant CSI  is obtained by  the minimum-meansquare-error (MMSE) channel estimation.   We consider Zero Forcing (ZF) algorithm and numerical optimization based solution of calculating precoder vectors maximizimg sum rate of multiuser system.   \r\nFor numerical simulation the QUADRIGA channel model reflecting the real propagation conditions for moving users is used.    The obtained performance of  multiuser Zero Forcing  and  optimization based beamforming in spatially correlated channel are compared based on the empirical cumulative density function of the sum rate of multiple users.",
    "authors": [
      "Aleksander Kalachikov"
    ]
  },
  {
    "id": 2161,
    "title": "Influence of Access Points' Height and High Signal Relation in WLAN Fingerprinting-Based Indoor Positioning Systems' Accuracy",
    "abstract": "Wireless Local Area Network (WLAN) Fingerprinting-based Indoor Positioning Systems (IPS) offer several key advantages over other indoor positioning technologies, including cost-effectiveness with high accuracy and passive tracking of entities' location without Global Positioning System (GPS) dependence. However, achieving a satisfactory accuracy performance of the WLAN fingerprinting-based IPS is still challenging, as it is affected by several factors, such as obstacles (e.g., walls and furniture) that can block or weaken wireless signals. Additionally, the IPS's accuracy can be affected by environmental changes, such as the height, addition, or removal of a WLAN Access Point (AP) or changes in radio frequency interference. This paper presents a novel algorithm incorporating a probabilistic analytical model employing only high signal relations that mitigate the effect of low signal relation on the WLAN fingerprinting-based IPS, thus improving the accuracy performance. Furthermore, it analyses the impact of AP heights on the accuracy performance of the WLAN IPS. Upon extensive experiments, the proposed algorithm improves the accuracy of the IPS by an average of 32.74% in terms of Root Mean Square Error (RMSE). These results imply that incorporating APs' height and high signal relations can significantly improve the accuracy performance of the WLAN fingerprinting-based IPS.",
    "authors": [
      "Mohammed muthanna"
    ]
  },
  {
    "id": 1876,
    "title": "On Reports in Open Transport Data Analysis Platform",
    "abstract": "According to UN studies, more than 60% of the population will live in cities by 2030. To change existing and build new transport systems, it is important to receive reports on changes in the transport behavior of city residents. In this article, we talk about the automated report generation module for an open platform for transport data analysis. The classification of transport changes in the city is given. The work of the module is demonstrated in the example of the analysis of changes in traffic flows in Moscow during the celebrations in early May.",
    "authors": [
      "Mark Bulygin",
      "Dmitry Namiot"
    ]
  },
  {
    "id": 1880,
    "title": "The Peak Age of Information of URLLC service in 5G NR Systems",
    "abstract": "Ultra-reliable low latency (URLLC) service is one of the cornerstone services that needs to be supported in fifth-generation (5G) cellular systems. For a class of applications utilizing URLLC service - periodic state updates, a vital metric of interest is Age of Information (AoI) characterizing the timeliness of updates received. The analysis of latency-related metrics in 5G cellular systems is however complicated by the orthogonal-frequency division multiple access (OFDMA) specifics resulting in batch service of packets. In this paper, we formalize the solve a queuing model capturing the specifics of URLLC service over OFDMA-enabled systems by explicitly accounting for batch service. For this model, we derive the mean peak AoI (PAoI).",
    "authors": [
      "Elena Zhbankova",
      "Varvara Manaeva",
      "Ekaterina Markova",
      "Yuliya Gaidamaka"
    ]
  },
  {
    "id": 1848,
    "title": "Towards a new format of datasets in traffic analysis",
    "abstract": "The purpose of this work is developing a reliable method to obtain datasets of network traffic with ground truth already defined. We developed a suite to obtain and store labeled datasets of traffic. Using this suite researchers are able to get datasets with accurate ground truth while not violating data privacy since the critical data is stripped and replaced by traffic meta description, allowing suite to be used for a wide range of traffic analysis methods.",
    "authors": [
      "Olga Morozova",
      "Margarita Orlova",
      "Nikita Naumov",
      "Leonid Abrosimov"
    ]
  },
  {
    "id": 1837,
    "title": "Решение для аутентификации устройств пользователей в корпоративной беспроводной сети университета с помощью механизма IEEE 802.1x",
    "abstract": "В данной работе предложено решение для аутентификации пользователей с помощью механизма IEEE 802.1x с использованием разработанного веб-сервера для распределения цифровых сертификатов в корпоративной беспроводной сети университета.",
    "authors": [
      "Daniil Yarchuk",
      "Margarita Orlova",
      "Leonid Abrosimov"
    ]
  },
  {
    "id": 1859,
    "title": "Characterizing Blockage Statistics of Reflected Propagation Paths in sub-THz Indoor Communications",
    "abstract": "The future 6G cellular systems are expected to utilize the lower part of the terahertz frequency band, 100-300 GHz. As a result of high path losses, the coverage of such systems will be limited to a few tens of meters making them suitable for indoor environments. As compared to outdoor deployments, indoor usage of THz systems is characterized by the need to operate over shorter distances using the reflected propagation paths. This paper aims to characterize the impact of blockage of reflected propagation paths in typical scenarios. Specifically, we carry out a detailed measurements campaign at 156 GHz and report reflection losses, blockage losses over the reflected path as well as blockage duration, signal fall and rise times. Our results show that signal polarization has a profound impact on the reflection losses with E-plane horizontally oriented signal losses being at least 8 dB higher as compared to H-plane signal horizontal orientation. Furthermore, the reflection material types do not affect the mean blockage attenuation over the reflected paths. Generally, the presence of a reflector neither quantitatively nor qualitative changes the mean attenuation induced by a blockage phenomenon.",
    "authors": [
      "Abdukodir Khakimov",
      "Evgeny Mokrov",
      "Vyacheslav Begishev",
      "Anatoliy Prikhodko",
      "Alexander Shurakov",
      "Gregory Goltsman"
    ]
  },
  {
    "id": 1872,
    "title": "Application Identification in mmWave/THz Systems via Machine Learning Algorithms",
    "abstract": "Beamtracking is a critical functionality in modern millimeter wave (mmWave) 5G New Radio (NR) systems  and is expected to become even more critical in future 6G systems operating in terahertz (THz) frequency band. To enable uninterrupted connectivity base stations (BS) need to invoke this procedure periodically. Due to the use of massive antenna arrays in 6G THz systems, the amount of resources consumed by beamtracking will be extremely large making the time interval between sweeping beam configurations a very critical parameter. One of the phenomena affecting the choice of this interval is a user equipment (UE) micromobility - quick displacements and rotations of UE in the hands of a user happening even when the latter is in a stationary position. In this paper, by utilizing machine learning (ML) algorithms, we propose a procedure for the detection of the beam center at the BS side for applications characterized by different types of micromobility. We demonstrate that one can safely differentiate between applications characterized by low as well as distinctively different micromobility speeds. All the considered classifieds including the tree, random forest, and neural network perform qualitatively similarly. For applications having fast and similar micromobility speeds such as VR and gaming, the classification accuracy stays at around 85-90%. However, this loss in accuracy does not affect the ultimate goal of the remote application detection algorithm - understanding how often the beam alignment procedure must be invoked at UE and BS.",
    "authors": [
      "Svetlana Dugaeva",
      "Vyacheslav Begishev",
      "Nikita Stepanov"
    ]
  },
  {
    "id": 1976,
    "title": "К прогнозированию качества радиоканала между БПЛА в рое с применением многослойной нейронной сети",
    "abstract": "В работе предложена и исследована методика выбора схемы модуляции и кодирования для передачи данных в радиоканале между устройствами беспроводной сети, основанная на прогнозировании значения отношения сигнал-помеха-шум (SINR) в следующем временном интервале по последовательности известных значений этого отношения в прошлом, с использованием машинного обучения с применением многослойной нейронной сети. Методика может применяться для оценки теоретически достижимых характеристик точности и надежности механизмов поддержки топологии в автономных роях дронов.",
    "authors": [
      "Alexandr Syrtsov",
      "EKATERINA BOBRIKOVA",
      "Irina Yartseva",
      "Vsevolod Shorgin",
      "Yuliya Gaidamaka"
    ]
  },
  {
    "id": 1879,
    "title": "Estimation of MAP component decoding of product codes in two-state channels",
    "abstract": "Product code construction is a powerful tool for both channels with and without memory. The common approach to decoding product (iterative) code is to apply consequent decoders in a sequential manner. The paper examines the influence of memory in the channel on iterative decoding for hard decision, soft decision, and trellis-based decoding algorithms. Also, the attainable performance of iterative schemes with and without knowledge of channel state information is presented.",
    "authors": [
      "Anna Fominykh",
      "Andrei Ovchinnikov"
    ]
  },
  {
    "id": 1917,
    "title": "Risk management in the design of computer network topology",
    "abstract": "Problems of a computer network risk management are often reduce to choosing the optimal set of countermeasures. The possibility of the network topology modification is usually not considered when solving such a problems. At the same time, the topology rebuilding is a natural process for some classes of networks (in particular, wireless mesh networks). This study considers the problem of designing the risk-minimizing computer network topology. The proposed solution is based on the results previously obtained in the research of the influence of the complex systems structure on their integral risk. The paper considers a particular case of the exact solution of the problem for a peer-to-peer distributed network of the \"bus\" topology. Also it proposes an algorithm for designing a risk-minimizing topology under attack scenarios of a simple chain structure.",
    "authors": [
      "Alexander Shiroky"
    ]
  },
  {
    "id": 1889,
    "title": "Об архитектурных решениях, ориентированных на прогнозирование и рациональное управление рисками в системной инженерии",
    "abstract": "Перспективная системная инженерия охватывает широкий спектр областей функционального применения систем, ориентирована на компьютерные системы и сети, становящиеся более разумными, самоорганизующимися, ресурсоэффективными и безопасными, устойчивыми в эксплуатации и реагирующими на постоянно растущий и разнообразный спектр общественных потребностей. Учитывая это, в работе рассмотрены концептуальные вопросы  архитектурного представления прикладных решений, ориентированных на прогнозирование и рациональное управление  рисками в жизненном цикле систем. В качестве рассматриваемых систем могут выступать: государство, регионы, органы управления, инфраструктура (инженерная, транспортная,  энергетическая, коммуникационная), предприятия, машины и механизмы, производимая продукция, процессы и пр. Примерами типовых задач, подлежащих решению, являются: прогнозирование рисков; обоснование допустимых рисков; выявление существенных угроз; обоснованию мер, направленных на достижение целей и противодействие угрозам; определение сбалансированных решений при  средне- и долгосрочном планировании; обоснование предложений по совершенствованию и развитию систем. Приведены варианты некоторых архитектурных решений.",
    "authors": [
      "Andrey Nistratov"
    ]
  },
  {
    "id": 1887,
    "title": "Вероятностное моделирование сопровождаемого цифрового двойника фрагментов магистральной трубопроводной сети для упреждающего противодействия природным угрозам",
    "abstract": "Цифровые двойники все шире охватывают характеристики различных объектов, систем и процессов. Сопровождение цифровых двойников во времени позволяет использовать накапливаемые исходные данные и существующие математические модели для упреждающего противодействия разнородным угрозам. Цифровые двойники фрагментов магистральных трубопроводных сетей сами по сути представляют собой распределенные компьютерные системы, подлежащие прагматичному использованию в интересах бизнеса. Исходя из этого в работе рассмотрены прикладные вопросы вероятностного моделирования сопровождаемого цифрового двойника фрагментов магистральной трубопроводной сети для упреждающего противодействия природным угрозам. Предложены вероятностные модели, методы их применения и интерпретации получаемых результатов моделирования",
    "authors": [
      "Andrey Nistratov"
    ]
  },
  {
    "id": 1860,
    "title": "Мониторинг и анализ трафика сетей передачи данных в крупных распределенных инфраструктурах на основе технологии NetFlow",
    "abstract": "В статье рассматриваются некоторые прикладные теоретические и практические аспекты многопараметрического анализа сетевого трафика с помощью технологии NetFlow. Перечисляются разработанные и вошедшие в практику методы и алгоритмы сбора, хранения, обработки и визуализации статистических данных о сетевом трафике, приводятся примеры реализующих их программных решений. Специальное внимание уделено соответствующим возможностям, доступным в высокопроизводительном программном комплексе мониторинга и управления цифровыми инфраструктурами “Центральный Пульт\" с акцентом на распределенную регистрацию и обработку телеметрических данных.",
    "authors": [
      "Alexey Abramov",
      "Konstantin Mikhailov"
    ]
  },
  {
    "id": 1986,
    "title": "Automated planning for service configuration management in IP/MPLS networks",
    "abstract": "The rapid growth in the number and variability of telecommunications services and increasing complexity of the functions performed by network devices causes the increasing complexity of the configuration settings that need to be applied to the network equipment. These brings service providers a need of searching the automatization techniques to reduce operation costs on service management process.\r\nThis paper proposes an approach to automate service lifecycle management in IP/MPLS networks through the automatic generation of configuration instructions for underlying network infrastructure. The proposed approach relies on the automated planning techniques which allow to generate a sequence of the configuration steps based on the initial service state and the desired one.",
    "authors": [
      "Elena Gibadullina"
    ]
  },
  {
    "id": 1881,
    "title": "On queuing systems with N policy and various server activation strategies",
    "abstract": "In this paper, we consider two single server queues under N policy with different activation strategies of the server. Customers arrive according to a Markovian Arrival Process and the service time follows a phase type distribution. The activation time of the server is exponentially distributed. We obtain stationary distribution of the queuing process using the Matrix Geometric Method. Using these distribution we calculate performance measures of the system. We also analyse this model numerically in order to have a comparison of the performance measures associated with it. An illustrative numerical example is discussed.",
    "authors": [
      "Greeshma Joseph",
      "Varghese Jacob",
      "Achyutha Krishnamoorthy"
    ]
  },
  {
    "id": 2239,
    "title": "Stochastic Modelling for Energy Efficiency in LTE-A and LTE-5G Networks",
    "abstract": "Energy efficiency in User Equipment (UE) is one of the major issues for\r\nlimited sources of power in the device. It is critical for the UE to maximize its\r\nenergy efficiency for both LTE-A and LTE-5G networks. To obtain the energy\r\nefficiency from LTE-A and LTE-5G networks, we have developed three stochastic\r\nmodels, namely the Markov model and semi-Markov model, for the UE based on\r\nthe states of discontinuous reception (DRX) mechanism and Markov regenerative\r\nprocess (MRGP) for the Modified DRX mechanism. Explicit expressions are\r\nderived for steady-state system size probabilities for all the models. Further,\r\nbased on the states of DRX mechanism, energy saving in the UE is computed\r\nand sensitivity analysis is performed for the Markov and semi-Markov models.\r\nFor the MRGP model, we have obtained the system’s optimal energy saving and\r\nthroughput by optimizing the maximum short sleep and short sleep duration.\r\nTo get the energy efficiency for LTE-5G networks, the trade-off between average\r\nenergy consumption/energy saving and throughput is shown. Further, our\r\nanalysis of DRX mechanism and conclusion on its performance can be designed\r\nand implemented to an extension for the existing DRX mechanism. We believe\r\nthat, these models can also be extended to study the energy saving of hardware\r\nand other components of the system.",
    "authors": [
      "Selvamuthu Dharmaraja",
      "Anisha Aggarwal",
      "Priyanka Kalita"
    ]
  },
  {
    "id": 1905,
    "title": "Model of operation of a cell of a mobile communication network with adaptive modulation schemes and batch arrivals",
    "abstract": "A model of a cell of a mobile communication network divided into a finite number of zones with dependence of the users' service rate on a zone  is considered. The arrival flow of users is defined by a batch marked Markovian process. The number of users that can receive service in a cell simultaneously is restricted.  The operation of the cell  is described by a multi-server queueing system whose dynamics is defined by a multi-dimensional Markov chain. The generator of the chain having the upper-Hessenbergian structure is derived. The  stationary distribution of {the chain} and the main characteristics of the quality of service are found.",
    "authors": [
      "Alexander Dudin",
      "Olga Dudina"
    ]
  },
  {
    "id": 2010,
    "title": "Batch Service Polling System: Mathematical and Simulation Modeling",
    "abstract": "In this paper, we study the mathematical and simulation models of the polling system with cyclic polling order and batch service. The service discipline is considered to be either exhaustive or gated. We discuss the numerical simulation results of systems with different batch size scenarios to examine the correlation between the system characteristics and the batch sizes of the queues.",
    "authors": [
      "Vladimir Vishnevsky",
      "Olga Semenova",
      "Van Hieu Nguyen",
      "Minh Cong Dang"
    ]
  },
  {
    "id": 2021,
    "title": "Multiphase queuing system with blocking and single common orbit retrial queue with limited buffer",
    "abstract": "We consider multiphase queuing systems of multiple blocking queues connected in linear topology and a common retrial queue with limited buffer for other queues in system. This kind of queuing systems can serve as model for wireless networks of asymmetric nodes, where a node with weak processing\r\npower or malfunctioned node can act as temporary waiting place for burst traffic. An analytical model of the system is investigated and from it performance measures are derived. Comparison of numerical results from analytical model with simulation model are also performed.",
    "authors": [
      "Vladimir Vishnevsky",
      "Olga Semenova",
      "Minh Cong Dang",
      "Van Hieu Nguyen"
    ]
  },
  {
    "id": 2035,
    "title": "A Machine-learning approach  to queue length estimation using tagged customers emission",
    "abstract": "In this paper, we consider the problem of the queue length estimation if only some small number of a so-called tagged customers is observable. The problem is treated in terms of the queueing of vehicles behind a traffic light. \r\nA supervised machine learning, particularly an artificial neural network, is used to construct non-linear relationships between the feature and the target. For data generation we simulate an appropriate queueing system. We used an auxiliary Fourier series correction factor by training the neural network. As a result, the quality of the queue length estimation expressed in form of the empirical distribution function of an absolute error was considerably improved.",
    "authors": [
      "Dmitry Efrosinin",
      "Vladimir Vishnevsky",
      "Natalia Stepanova"
    ]
  },
  {
    "id": 1861,
    "title": "The simulation of finite-source retrial queues with two-way communication to the orbit using a backup server",
    "abstract": "This paper investigates a two-way communication retrial queuing system with a server that may experience random breakdowns. The system is a finite-source M/M/1//N type, and the idle server can make calls to the customers in the orbit, also known as secondary customers. The service time of the primary and secondary customers follow independent exponential distributions with rates of μ_1 and μ_2, respectively. The novelty of this study is to analyze the impact of various distributions of failure time on the key performance measures using a backup server, such as the mean response time of an arbitrary customer. One could think of a backup server as a primary server that operates at a reduced rate during periods of repair. To ensure a valid comparison, a fitting process is conducted so that the mean and variance of every distribution are equal. The self-developed simulation program provides graphical illustrations of the results.",
    "authors": [
      "Ádám Tóth",
      "János Sztrik"
    ]
  },
  {
    "id": 1895,
    "title": "The regenerative stability analysis of some vacation models",
    "abstract": "In this research we consider two different vacation model. First, we study the stability of a multi-server vacation model with self-sustained servers and some general distribution of service time. Also we consider a single-server vacation model, when there are consecutive periods of attachment (glue), service and vacation. We present the stability conditions of these systems which have been obtained in previous works by various methods. The purpose of this note is to show how the regenerative methodology allows to deduce these stability conditions of these systems by a unified way.",
    "authors": [
      "Stepan Rogozin"
    ]
  },
  {
    "id": 1897,
    "title": "Adaptive redistribution of traffic heterogeneous in acceptable delays with transmission replication during route reconfiguration in nodes connecting segments of multipath networks",
    "abstract": "Increasing reliability and reducing delays in multipath networks is achieved due to redundancy of paths and the ability to balance their workload. The possibility of increasing the reliability of transmissions and reducing the delays of the most critical packets is provided by the replication of packet transmissions along different routes of their delivery to the addressee. The article explores additional possibilities for reducing delays and increasing the probability of timely delivery of the most critical requests in the two-stage formation of routes with a possible change in the multiplicity of replication in communication nodes connecting different ways of delivering packages to the addressee. In case of redundant transmission of packets from the request source during route reconfiguration, replication is carried out on the packet delivered first in time. Approaches to reaching a compromise on ensuring timely delivery of a heterogeneous stream to the addressee with different criticality to acceptable network delays are considered. Optimization was carried out under the conditions of uncertainty of changes in traffic intensity. The optimization is compared by the average traffic intensity and with adaptive optimization, taking into account traffic changes. The efficiency of the formation and routes from the source of requests with additional reconfiguration is shown when it is possible to change the multiplicity of transmissions in intermediate communication nodes connecting the formed data delivery paths to the addressee.",
    "authors": [
      "Vladimir Bogatyrev",
      "Stanislav Bogatyrev",
      "Anatoly Bogatyrev"
    ]
  },
  {
    "id": 1900,
    "title": "Readiness for timely execution of requests in fault-tolerant clusters with information recovery based on replication and backup",
    "abstract": "The reliability model of the restored cluster is proposed, which provides for physical and informational recovery of memory nodes, carried out on the basis of replacing the failed memory node with a node in which the results of the last backup are previously entered, with further updating of information when replicating data from working memory blocks containing up-to-date information. If all memory nodes with up-to-date information have failed, then using the system to perform the required tasks until the information is fully restored is fraught with risks of erroneous request servicing. Options for reducing these risks are considered.",
    "authors": [
      "Vladimir Bogatyrev",
      "Anatoly Bogatyrev",
      "Stanislav Bogatyrev"
    ]
  },
  {
    "id": 1933,
    "title": "G-сеть состоящая из ненадёжных систем с контрольными и карантинными очередями и возможностью перемещения отрицательных заявок между системами сети",
    "abstract": "Объектом исследования в статье является G-сеть состоящая из ненадёжных карантинных, контрольных и обслуживающих очередей в системах. Отрицательные заявки после уничтожения одной положительной или приведения системы в неисправность могут как покидать сеть, так и перемещаться между системами сети. Данный является математической моделью компьютерной сети, в каждом устройстве которой установлено антивирусное программное обеспечение (АПО) и возможностями распространения вредоносного кода между системами сети и создания неисправности ПО на устройстве. Предполагается, что в определённой доле случаев вирус может обмануть АПО с причинить компьютерной сети вред. Такое возможно до тех пор, пока вирус не будет обнаружен АПО определённой системы. С помощью метода многомерных производящих функций находятся нестационарные вероятности состояний и средние характеристики данной сети, функционирующей в режиме насыщения.",
    "authors": [
      "Dzmitry Kopats"
    ]
  },
  {
    "id": 2033,
    "title": "Maximum Likelihood Estimation of the Dead Time Distribution Parameter in Recurrent Semi-Synchronous Doubly Stochastic Events Flow",
    "abstract": "In this study, recurrent semi-synchronous events flow with two states is described. Operation of the flow is considered with random non-prolonging dead time that has uniform distribution. Maximum likelihood estimation of a distribution parameter of the dead time duration is provided.",
    "authors": [
      "Anna Vetkina",
      "Людмила Нежельская"
    ]
  },
  {
    "id": 1877,
    "title": "Myopic Inventory Control with Returns in Case of Uncertainty: Adaptive Algorithms",
    "abstract": "A model of inventory control with returns is considered, when it is possible for consumers to return the products they have purchased in case of uncertainty when the probability distribution of a random variable of one-step demand is a priori unknown. It is shown that in this case the optimal inventory management strategy is 4-parametric and adaptive algorithms are constructed that converge with probability 1 to the true values of these parameters.",
    "authors": [
      "A. Kozhan",
      "Viktor Laptin",
      "Alexander Mandel"
    ]
  },
  {
    "id": 1817,
    "title": "Information Spreading in Non-homogeneous Evolving Networks with node and edge deletion",
    "abstract": "A preferential attachment (PA) has been suggested to model network evolution and to explain conjectured power-law node degree distributions in real-world networks. In Markovich, Ryzhov (2022a,b), the schemes of the linear PA  proposed in Wan et al. (2020) for the network evolution were suggested for information spreading. The PA and the well-known algorithm SPREAD proposed in Mosk-Aoyama, Shah (2006) were compared regarding the minimum number of evolution steps $K^*$  required to spread a single message among a fixed number of nodes in non-homogeneous directed networks.  This comparison was done  in Markovich, Ryzhov (2022a,b) without node and edge deletion    during the evolution. The objective of the current study is to investigate the impact of the PA parameters on   spreading of a single message to a fixed number of nodes in the graph when an existing node or edge is uniformly deleted  at each step of the PA evolution. The results are provided for  simulated and real graphs.",
    "authors": [
      "Natalia Markovich",
      "Maksim Ryzhov"
    ]
  },
  {
    "id": 1890,
    "title": "On the variance reduction methods for estimating the reliability of the multi-phase Gaussian degradation system",
    "abstract": "We consider the Gaussian  multi-phase degradation model. The main target quantity is reliability defined as the tail distribution of the system lifetime. When the required performance measure has no closed-form expression one has to rely on simulation methods. Since the reliability is usually extremely small the problem of the rare-event simulation arises. To tackle this problem a few variance reduction methods have been applied. Some numerical experiments are performed to compare the relative error of the proposed estimators.",
    "authors": [
      "Oleg Lukashenko"
    ]
  },
  {
    "id": 1898,
    "title": "Об экстремальном индексе стационарного времени ожидания в системах GI/G/1с неоднородными входными потоками",
    "abstract": "Рассмотрена односерверная система M/G/1, в которой входной поток является конечной смесью двух распределений. Построены границы для  экстремального индекса стационарного времени ожидания.",
    "authors": [
      "Irina Peshkova"
    ]
  },
  {
    "id": 1971,
    "title": "Модель работы процессора в условиях конкуренции за вычислительный ресурс",
    "abstract": "В работе рассматривается модель работы  вычислительного процессора в виде системы массового обслуживания с неограниченным числом приборов и деградацией скорости обслуживания. Деградация скорости обслуживания означает функциональную зависимость интенсивности обслуживания поступающих запросов от общего числа запросов в системе. Введение в модель функции деградации скорости обслуживания позволяет учитывать снижение производительности процессора при увеличении нагрузки на него. В результате модификации и применения метода асимптотического анализа была получена Гауссовская аппроксимация распределения вероятностей числа заявок в системе, что соответствует распределению одновременно выполняемых задач процессором.",
    "authors": [
      "Anatoly Nazarov",
      "Ivan Lapatin",
      "Svetlana Paul"
    ]
  },
  {
    "id": 1869,
    "title": "Математическая модель двухэтапного производственного процесса в виде двухфазной СМО с двумя входящими пуассоновскими потоками и обратной связью",
    "abstract": "В работе представлена математическая модель двухэтапного производственного процесса в виде двухфазной системы массового обслуживания (СМО) с входящими пуассоновскими потоками на первую и вторую фазы. Каждая фаза состоит из бесконечного числа устройств. Время обслуживания заявок распределено согласно экспоненциального закона. После обслуживания на первой фазе, заявка с вероятностью r_1 переходит на вторую фазу, либо, с вероятностью 1-r_1 возвращается на первую для повторного обслуживания. По завершению обслуживания на второй фазе, заявка с вероятностью r_2 покидает систему, либо, с вероятностью 1-r_2  возвращается для повторного обслуживания на вторую фазу.  Получен вид производящей функции для случайного процесса, характеризующего число событий в потоке повторных обращений",
    "authors": [
      "Любовь Задиранова"
    ]
  },
  {
    "id": 1885,
    "title": "Метод марковского суммирования для исследования суммарного потока повторных обращений в многофазной системе массового обслуживания с обратной связью",
    "abstract": "В статье рассматривается многофазная система массового обслуживания с неограниченным числом приборов. За повторное обслуживания мы берем переход заявки с фазы на фазу, отсюда получаем систему с мгновенной обратной связью. Исследуется поток повторных обращений заявок к системе. Получен вид характеристической функции числа повторных обращений к системе при нестационарном режиме работы, при условии, что в начальный момент времени система пуста.",
    "authors": [
      "Artem Podgainov",
      "Maria Shklennik"
    ]
  },
  {
    "id": 1980,
    "title": "Модель гетерогенной системы передачи данных с очередью и переключением каналов",
    "abstract": "В данной работе рассматривается  гетерогенная многолинейная система массового обслуживания с ожиданием, особенность которой заключается в том, что для обработки и передачи данных предоставлены два гетерогенных ресурса разной интенсивности обслуживания и предоставляется возможность переподключения на более быстрый канал, при наличии там свободных единиц канального ресурса.  Предложен рекуррентный алгоритм для нахождения стационарных вероятностей и проведен  анализ характеристик качества обслуживания.",
    "authors": [
      "Ekaterina Pakulova",
      "Svetlana Moiseeva",
      "Alexander Moiseev",
      "Светлана Чижикова"
    ]
  },
  {
    "id": 1971,
    "title": "Модель работы процессора в условиях конкуренции за вычислительный ресурс",
    "abstract": "В работе рассматривается модель работы  вычислительного процессора в виде системы массового обслуживания с неограниченным числом приборов и деградацией скорости обслуживания. Деградация скорости обслуживания означает функциональную зависимость интенсивности обслуживания поступающих запросов от общего числа запросов в системе. Введение в модель функции деградации скорости обслуживания позволяет учитывать снижение производительности процессора при увеличении нагрузки на него. В результате модификации и применения метода асимптотического анализа была получена Гауссовская аппроксимация распределения вероятностей числа заявок в системе, что соответствует распределению одновременно выполняемых задач процессором.",
    "authors": [
      "Ivan Lapatin",
      "Svetlana Paul",
      "Anatoly Nazarov"
    ]
  },
  {
    "id": 1928,
    "title": "Вероятностные характеристики процесса соперничества за полосу пропускания тракта передачи данных на уровне транспортного протокола с селективным режимом повтора",
    "abstract": "Рассмотрена индикаторная модель транспортного соединения для режима селективного отказа в условиях конкуренции между различными абонентскими соединениями за полосу пропускания передающего тракта. Функционирование транспортного соединения моделируется марковизированным процессом с дискретным временем. Дополнительным параметром, марковизирующим процесс передачи данных, является размер очереди конкурентных потоков данных в транзитных узлах транспортного соединения. Получено распределение вероятностей состояний цепи Маркова.",
    "authors": [
      "Sergey Sushchenko"
    ]
  },
  {
    "id": 1988,
    "title": "Mathematical model for analyzing optical switch performance metrics in transient mode",
    "abstract": "A transient behavior of all-optical switch using a single-channel finite buffer queuing system with Poisson input stream and exponential service time distribution model is considered in this paper. The apparatus of the Laplace transform was used to solve the Kolmogorov equations system. Analytical expressions for the probability of losses and the throughput of all-optical switch in transient mode are found. In a numerical example, the performance metrics of all-optical switch with a buffer size of two packets are analyzed for different network loads in transient and stationary modes.",
    "authors": [
      "Konstantin Vytovtov",
      "Elizaveta Barabanova",
      "Nickolay Antonov"
    ]
  },
  {
    "id": 1989,
    "title": "Mathematical models for reliability analysis of all-optical switches",
    "abstract": "In this work, simulation models of all-optical switches, such as the Clos, Banyan, matrix and dual switches, are developed. The most efficient modes of operation of switches are considered.",
    "authors": [
      "Elizaveta Barabanova",
      "Konstantin Vytovtov",
      "Anastasia Fedorovskaya"
    ]
  },
  {
    "id": 1990,
    "title": "Investigation of tethered unmanned high-altitude platform reliability",
    "abstract": "The reliability of the tethered unmanned high-altitude platform as a single complex system is investigated in this paper. The reliability block diagram of the platform has been developed. It consists of the main subsystems and its elements connected in series. The method of calculating the reliability metrics of the tethered unmanned high-altitude platform such as the reliability function, and the mean time to failure is presented. The example of the reliability investigation method application and the example of communication subsystem reliability metrics calculation is presented. The approach of fiber-optical cable failure rate calculation is considered.",
    "authors": [
      "Vladimir Vishnevsky",
      "Elizaveta Barabanova",
      "Konstantin Vytovtov",
      "Georgiy Vytovtov"
    ]
  },
  {
    "id": 2002,
    "title": "On Reliability Function of a k-out-of-n Model in Case of Quick Recovery of Its Components",
    "abstract": "In some previous works, closed-form representations for reliability characteristics of k-out-of-n model with an exponential distribution of components lifetime and arbitrary distribution of their repair time have been found. In that investigation, the markovization method was applied for calculation of the main reliability characteristics. \r\nIn the recent paper, reliability function is considered for a repairable k-out-of-n model in the same assumptions about life and repair time distributions. The problem of its sensitivity in case of quick recovery of system’s components is discussed on an example of 2-out-of-n model. It is shown that the reliability function in scale of its mean time to failure is asymptotically exponential.",
    "authors": [
      "Vladimir Rykov",
      "Nika Ivanova"
    ]
  },
  {
    "id": 2008,
    "title": "About quasi-renewal processes and quasi-regenerative processes",
    "abstract": "The study of the behaviour of stochastic processes in queuing theory and related fields is often based on the study of the behaviour of regenerative Markov piecewise linear processes. But the behaviour of a complex queuing system or a complex reliability model can be described by a non-regenerative stochastic process, but this non-regenerative process can be in some sense ``close'' to some regenerative process. In this case, embedded processes that would correspond to embedded renewal processes turn out to be in some sense ``close'' to some ``classical'' renewal processes. Therefore, we introduce the concept of quasi-renewal and quasi-regenerative processes, and we give here an example of a quasi-regenerative process and its embedded quasi-renewal process. We also propose a method for obtaining the upper bounds for the convergence rate of the distribution of a regenerative and quasi-regenerative process to a stationary distribution, if this process is ergodic.",
    "authors": [
      "Galina Zverkina"
    ]
  },
  {
    "id": 1826,
    "title": "On Comparison of Waiting Buffer Scheduling Methods  in a Resource Loss System",
    "abstract": "Fifth-generation (5G) networks are expected to revolutionize wireless communication by enabling faster and more reliable data transfer rates. However, the use of millimeter-wave frequencies in 5G networks introduces unique challenges in data transmission due to phenomena such as dynamic signal blockage, which can result in sudden and intense resource demands for sessions. This paper presents a mathematical model of a 5G base station using a resource allocation system with waiting and non-homogeneous resource requirements for sessions. The study aims to determine the most efficient way to select sessions from the waiting buffer to increase system performance and minimize the probability of blocking data sessions and reduce waiting time in the waiting buffer. As a result of the research, it was found, that the method that prioritized sessions with the highest resource requirements and took them from the waiting buffer until the system reached its limit, demonstrates the best system performance under certain parameters.",
    "authors": [
      "Viktor Stepanov",
      "Anastasia Daraseliya",
      "Eduard Sopin"
    ]
  },
  {
    "id": 1866,
    "title": "Analysis of Procedures to Ensure the Required QoS Indicators in Multiservice Access Nodes",
    "abstract": "A generalized mathematical model of joint servicing of real-time traffic and data (files) traffic in a multiservice access node has been constructed and investigated. The model takes into account the presence of a priority for real-time traffic, as well as the group nature of the arrival, elastic properties, the possibility of waiting and aging of the transmitted information for data traffic. The coming of requests for the transmission of real-time traffic and groups of files obeys the Poisson laws, and the service times have an exponential distribution.\r\nThe definitions of the indicators of the quality of the joint service of incoming requests are formulated and a method for their evaluation based on the solution of a system of equilibrium equations is considered. The use of the model for solving the problems of estimating the value of  transmission resource required to serve  the offered traffic for given QoS indicators and estimating the volume of the offered  traffic offloaded in a situation of congestion to other access nodes in order to achieve the specified QoS indicators is considered.",
    "authors": [
      "Mikhail Stepanov",
      "Sergey Stepanov",
      "Margarita Kanishcheva",
      "Fedor Kroshin"
    ]
  },
  {
    "id": 2025,
    "title": "Задача анализа вероятностных характеристик системы интегрированного доступа и транзита",
    "abstract": "В представленном исследовании анализируются показатели эффективности технологии интегрированного доступа и транзита, разработанной консорциумом 3GPP для миллиметровых беспроводных сетей. Технология предназначена для решения проблем развертывания подвижных базовых станций в сложных городских условиях с плотной застройкой и наличием подвижных и стационарных блокаторов радиосигнала. В рамках исследования разработана модель и сценарий применения IAB, программа имитационного моделирования на языке GPSS и аналитическая модель фрагмента системы в виде поллинговой системы массового обслуживания. В качестве основных показателей эффективности выбраны средние сквозные задержки и среднее число пакетов в сети и на отдельных маршрутах.",
    "authors": [
      "Vladislav Feoktistov",
      "Dmitry Nikolaev",
      "Yuliya Gaidamaka",
      "Konstantin Samouylov"
    ]
  },
  {
    "id": 2040,
    "title": "Об одной модели обслуживания базовой станицей комбинации двух типов трафика с учетом нарушения прямой видимости",
    "abstract": "Из-за растущего спроса на беспроводную передачу данных появилась необходимость использовать волны миллиметрового диапазона для увеличения скорости передачи данных и минимизации задержек. Но при безусловных преимуществах этой технологии, одним из недостатков является чувствительность к блокировкам прямой видимости между приемо-передающими устройствами, что может приводить к прерыванию обслуживания, снижая качество предоставления услуг пользователям сети. Ввиду противоположных требований к организации одноадресных и многоадресных соединений требуется внедрение эффективных решений, позволяющих передавать комбинацию указанных типов трафика. В данной работе, применяя методы теории массового обслуживания и метод расстановки приоритетов между разными типами трафика, построена математическая модель передачи комбинации двух типов трафика с учетом возможности нарушения прямой видимости между устройствами пользователей и базовой станцией. Отличием такой модели является разделение зоны покрытия на две области - круг и кольцо, что позволяет учесть особенности распространения сигнала. Построенная математическая модель позволяет найти аналитические выражения для получения вероятностей потери одноадресных и многоадресных соединений, а также объем занятого ресурса.",
    "authors": [
      "Faina Moskaleva"
    ]
  },
  {
    "id": 2034,
    "title": "Исследование fork-join системы с марковским входным потоком и распределением времени обслуживания фазового типа",
    "abstract": "В настоящей работе исследуется fork-join система массового обслуживания с марковским входным потоком. Каждый из поступающих в систему запросов разбивается на два подзапроса (задачи), которые попадают в две подсистемы. Каждая из подсистем состоит из одного прибора и буфера. Будем считать, что очередь к одному из приборов имеет неограниченную емкость, а ко второму прибору --- конечный объем. Время обслуживания на приборах имеет фазовое распределение. Для описанной системы получено условие существования стационарного режима, кроме того, представлены алгоритмы для расчета стационарного распределения, а также для ряда стационарных показателей производительности системы.",
    "authors": [
      "Valentina Klimenok",
      "Vladimir Vishnevsky",
      "Andrey Larionov",
      "Anastasia Gorbunova",
      "Aleksandr Sokolov"
    ]
  },
  {
    "id": 1867,
    "title": "Приоритетная система обслуживания с профилактиками прибора в общих предположениях на управляющие последовательности.",
    "abstract": "Данная работа посвящена рассмотрению приоритетной системы массового обслуживания, в которой предусмотрены профилактики обслуживающего прибора. Интервалы между поступлениями требований являются независимыми в совокупности случайными величинами с произвольным абсолютно непрерывным распределением. Поступающие требования разделяются на несколько приоритетных классов, независимо друг от друга и от состояния системы, между классами установлена дисциплина относительного приоритета. Распределение времен обслуживания каждого класса также является произвольным абсолютно непрерывным. В те моменты времени, когда система становится свободной, обслуживающий прибор отправляется на профилактику, которая длится случайное время с заданной функцией распределения, длительность профилактики не зависит ни от входящего потока, ни от времен обслуживания, ни от длительности других профилактик. В работе найдено нестационарное совместное распределение количества заявок каждого приоритета в системе.",
    "authors": [
      "Alexey Bergovin",
      "Vladimir Ushakov"
    ]
  },
  {
    "id": 2167,
    "title": "Revolutionizing H2M Interaction: Telepresence System Enabling Sign Language Expansion for Individuals with Disabilities",
    "abstract": "The modern network technology ecosystem is expanding rapidly in multiple dimensions. Due to the demands of the Tactile Internet and fifth-generation (5G) networks, conventional approaches are no longer producing significant advancements. The imminent integration of immersive technologies holds the potential to revolutionize human existence, ushering in a new era of fully realized and enhanced human-to-machine interactions (H2M). This paradigm shift is poised to offer many benefits and adopt wireless technologies to enable real-time remote control. Concurrently, introducing the Tactile Internet necessitates a fundamental reevaluation of the foundational principles governing current and prospective communication networks. This article delves into an experimental endeavor that seeks to seamlessly integrate immersive technologies within 5G networks. A microservice application was developed for this purpose, simulating the nuanced movements of a person’s hand in space and facilitating the expression of intricate gestures. The article also delves into the strategies employed to minimize latency, enhancing the overall experience.",
    "authors": [
      "Ammar Muthanna",
      "Andrey Koucheryavy"
    ]
  },
  {
    "id": 2165,
    "title": "Efficient Transmission of Holographic Images: A Novel Approach Toward 6G Telepresence Services",
    "abstract": "In recent years, advancements in technology have brought forth a new frontier in visual communication. Holography is a technique that captures and reproduces three-dimensional (3D) images with an unprecedented level of realism and depth, has emerged as a groundbreaking method for conveying visual information. Unlike traditional images and videos, holography recreates scenes with full parallax, enabling viewers to perceive objects from various angles. The transmission of holographic images presents both exciting possibilities and unique challenges. To this end, this article investigates a novel method for transmitting holographic images efficiently across communication networks. This innovative approach involves transmitting data related to control point movements rather than the entire image. The technique focuses on capturing the dynamic 3D movements of a person and transmitting information about the shifts in their control points. To achieve this, a system comprising three distinct applications has been devised. These applications are responsible for recording object motion data, converting it into key point coordinates, transmitting it through communication networks, and rendering the data as movements of a 3D object within an augmented reality (AR) application.",
    "authors": [
      "Artem Volkov",
      "Andrey Koucheryavy",
      "Daniil Svechnikov"
    ]
  },
  {
    "id": 2157,
    "title": "Distributed system for scientific and engineering computations with problem containerization and prioritization",
    "abstract": "A key challenge in computer modeling is obtaining numerical results on large input datasets. For instance, this problem arises when researchers need to produce a visualization of an economic or physical process, as well as during the computation of characteristics of complex mathematical models using the Monte Carlo method. Each problem requires repeating the same program on a large set of inputs, consuming much time, from several hours to days and weeks. Computational algorithms may be implemented in different programming languages and may require various specific tools like GNU Octave, NS-3, or OMNeT++. This article describes a distributed system architecture, which can speed up the process of obtaining results for such problems. The system comprises a backend server, a control service (supervisor), worker nodes, and a database. These algorithms are executed in Docker containers to abstract from particular languages and tools required for computational algorithms. The system supports several strategies for problem prioritization to operate efficiently under heavy loads introduced by multiple users. To use the system, the user only needs to build a Docker image with an encapsulated algorithm, describe the input dataset in a JSON file, and upload them via the web interface. The system can be deployed in any public cloud. In this article, we describe the system architecture and numerical results obtained from computations on various clouds and local platforms. We demonstrate that the computation time for CPU-bound problems in different public clouds varies greatly. Finally, we show the influence of different prioritization strategies on the duration of computations under a moderate workload.",
    "authors": [
      "Aleksandr Sokolov",
      "Andrey Larionov",
      "Amir Mukhtarov"
    ]
  },
  {
    "id": 2086,
    "title": "Overview of research works on applications of UHF RFID on vehicles for data transmission",
    "abstract": "RFID technology (Radio Frequency IDentification) has found wide application in many areas of science and technology, everyday life. At the moment, it is used everywhere from libraries to industrial warehouses. At the same time, the number of RFID applications is growing every year, and at the same time, the number of scientific papers investigating certain issues related to this topic is increasing. One of these rapidly developing areas is the use of RFID for fast-moving objects: cars and unmanned aerial vehicles.\r\n\r\nThis article provides an overview of RFID technology, the features of signal propagation in an RFID wireless communication channel, as well as research and some commercial applications in the field of using RFID technology to transfer data between objects moving relative to each other. About 100 articles were considered and classified in the total score, the most popular areas of scientific work were highlighted, and non-standard projects for RFID were considered.",
    "authors": [
      "Vilmen Abramian",
      "Ivan Fedotov",
      "Andrey Larionov"
    ]
  },
  {
    "id": 1891,
    "title": "On the identification of a finite automaton by its input and output sequences in case of distortions",
    "abstract": "A method is proposed for checking whether a pair of observed distorted sequences can correspond to the true input and output sequences of a reference automaton, provided that the initial state of the automaton is unknown, and the proportion of deletions, insertions, and replacements of symbols is small.",
    "authors": [
      "Sergey Melnikov",
      "Konstantin Samouylov",
      "Andrey Zyazin"
    ]
  },
  {
    "id": 1874,
    "title": "Применение аппаратных счетчиков производительности для выявления угроз информационной безопасности приложений",
    "abstract": "Работа посвящена исследованию возможностей применения аппаратных счетчиков производительности для выявления потенциальных угроз безопасности критически важных систем и комплексов. Приведено описание прикладного программного интерфейса измерения производительности, доработанного авторами для отечественной аппаратно-программной платформы.",
    "authors": [
      "Konstantin Kostiukhin",
      "Vladimir Galatenko"
    ]
  },
  {
    "id": 1914,
    "title": "On the Evasion Attack Detector",
    "abstract": "The paper deals with the issue of detecting adversarial attacks on machine\r\nlearning models. Such attacks are understood as deliberate (special) data\r\nchanges at one of the stages of the machine learning pipeline, which is designed\r\nto either prevent the operation of the machine learning system, or vice versa,\r\nto achieve the desired result for the attacker. Contention attacks pose a great\r\nthreat to machine learning systems because they do not guarantee the results\r\nand quality of the system. And such guarantees are, for example, mandatory for\r\nthe use of a machine learning (artificial intelligence) system in critical areas such\r\nas avionics, automatic driving, special applications, etc. The article considers\r\none of the possible detectors for the so-called evasion attacks.",
    "authors": [
      "Dmitry Namiot"
    ]
  },
  {
    "id": 1916,
    "title": "On the Machine Learning Models Inversion Attack Detector",
    "abstract": "This article is devoted to the detection of adversarial attacks on machine\r\nlearning models. In the most general case, adversarial attacks are special data\r\nchanges at one of the stages of the machine learning pipeline, which are designed\r\nto either prevent the operation of the machine learning system, or vice versa, to\r\nachieve the desired result for the attacker. But there is also a form of attack\r\naimed at extracting non-public information from machine learning models. These\r\ninclude model inversion attacks. These types of attacks pose a threat to the use\r\nof machine learning as a service (MLaaS). Machine learning models accumulate\r\na lot of redundant information during training, and the possibility of exposing\r\nthis data while using the model can come as an unpleasant surprise.\r\nKeywords: machine learning, adversarial attacks, model inversion\r\n1. Introduction\r\nMachine learning systems (and, at least now, it is a synonym for artificial\r\nintelligence systems) depend on data. This tautological statement leads, in fact, to\r\nquite serious consequences. Changing the data then, generally speaking, changes the\r\nperformance of the model. Purposeful data changes are attacks on machine learning\r\nmodels [1]. But the models themselves can be directly affected during attacks. For\r\nexample, weights can change on the fly, malicious code can be loaded into weights, etc.\r\nAdversarial attacks, which are possible for any discriminant machine learning models,\r\npose a great threat to machine learning systems, since they do not guarantee the\r\nresults and quality of the system. And such guarantees are, for example, mandatory\r\nfor the use of a machine learning (artificial intelligence) system in critical areas such\r\nas avionics, automatic driving, special applications, etc. [2 , 3 ]. An attack directly on\r\nthe model also carries additional risks of extracting private information stored in\r\nmachine learning models [4]. Detection (determination of the fact of implementation)\r\nof attacks related to the extraction of information is the subject of this work.\r\nThe remainder of the article is structured as follows. In section 2, we focus on\r\nattacks on intellectual property. Section 3 presents the developed algorithm for\r\ndetecting extraction attacks. Section 4 presents the conclusion.",
    "authors": [
      "Dmitry Namiot"
    ]
  },
  {
    "id": 1857,
    "title": "On classification of the cytological images of leukocytes with transfer deep learning models",
    "abstract": "White blood cells, also known as white blood cells (WBC), play an important role in protecting the human body from foreign intruders, including bacteria and viruses, and dangerous diseases caused by them. The article implements a computer approach to the classification and detection of white blood cells on cytological images of blood cells using deep learning methods. A LeucoCyteNetv2 blood image classification model is proposed, the architecture of which includes SeparableConv2D convolutional layers separated by depth. The developed model classifies leukocytes with an accuracy of 98.86\\%, which allowed us to assert the possibility of their use as an auxiliary tool for hematological blood analysis.",
    "authors": [
      "Eugene Yu. Shchetinin",
      "Leonid Sevastianov",
      "Anastasia Glushkova",
      "Anastasia Demidova"
    ]
  },
  {
    "id": 1991,
    "title": "Machine Learning-Based Models for the Compressibility Factor of Natural Gas",
    "abstract": "The paper presents an example of the so-called surrogate modeling. This is a computer modeling technique where machine learning methods are used to build a fast (surrogate) model that allows you to get a result with acceptable accuracy on data from a complex (physically proven, built on a solution of systems of nonlinear algebraic equations or partial differential equations) and resource-intensive model of an object or process. We develop and analyze the models for calculating  the compressibility factor trained on a large amount of data calculated  with AGA-8 equation of state. The presented models can be applied to replace the original model when analyzing the development of risk situations and searching for optimal gas transportation modes, in software designed for staff training on computer simulators.",
    "authors": [
      "Olga Kochueva",
      "Ruslan Akhmetzianov"
    ]
  },
  {
    "id": 1884,
    "title": "Поиск корректного отображения параллельных вычислений на систему с коммутационной средой RapidIO методами ЦЛП",
    "abstract": "Работа посвящена вопросам отображения параллельных вычислений на\r\nраспределенные системы с коммутационной средой RapidIO. Под параллель-\r\nным вычислением понимается множество процессов, взаимодействующих\r\nпосредством передачи потоков данных. Требуется назначить вычислитель-\r\nные узлы для процессов и определить маршруты для потоков данных, а\r\nтакже построить таблицы маршрутизации для коммутаторов. В работе\r\nпредложен подход, основанный на методах целочисленного линейного про-\r\nграммирования (ЦЛП), позволяющий корректно отобразить параллельное\r\nвычисление на распределенную систему и оптимизировать отображение по\r\nряду характеристик.",
    "authors": [
      "Sergej Samborskij",
      "Vladimir Galatenko",
      "Antony Pavlov"
    ]
  },
  {
    "id": 1982,
    "title": "Анализ полноты и актуальности выходной информации в распределенных компьютерных и телекоммуникационных системах, обеспечивающих проведение избирательных кампаний",
    "abstract": "Применительно к системам, обеспечивающим проведение избирательных кампаний, проанализировано качество выходной информации для избирателей. На основе применения авторских вероятностных моделей количественно оценено влияние используемых распределенных компьютерных и телекоммуникационных систем на такие свойства качества, как полнота и актуальность выходной информации о ходе и результатах выборов.",
    "authors": [
      "Andrey Kostogryzov"
    ]
  },
  {
    "id": 1871,
    "title": "About heuristic algorithm for Correlation Clustering problem solving",
    "abstract": "The Correlation Clustering (CC) problem is traditionally defined as a problem of partitioning a signed graph without specifying the number of clusters in advance. In this paper, CC problem is considered for undirected and unweighted signed graphs without multiple edges and loops, where error functional is linear combination of intercluster and intracluster errors. In this formulation, the CC problem is NP-complete. Exact algorithms for this problem are time-consuming. Approximate algorithms for solving CC problem often lead to unsatisfactory results, and heuristic algorithms are often non-deterministic in the number of steps leading to a solution. We propose a new heuristic algorithm SGClustAlpha for CC problem solving. The main idea of this algorithm is in minimizing of intracluster error and optimization of error functional according to the greedy strategy. It was proved that this algorithm takes polynomial time. Numerical experiments were carried out on randomly generated signed graphs.",
    "authors": [
      "Aleksandr Soldatenko",
      "Daria Semenova",
      "Ellada Ibragimova"
    ]
  },
  {
    "id": 1,
    "title": "A SemiMarkov Approach for Reliability Analysis of High\nAltitude Platforms",
    "abstract": "",
    "authors": [
      "Vidyottama Jain"
    ]
  },
  {
    "id": 2,
    "title": "     \n ",
    "abstract": "",
    "authors": [
      "Anatoly Nazarov",
      "Svetlana Paul"
    ]
  }
]
